{
  "Warrior": {
    "desc": "You’re quick, strong, and militant. Combat is your speciality, and you’re able to deal and sustain more damage than any other.",
    "adv_table": [
      "Parry",
      "Fast strikes",
      "It's all in the wrist",
      "Establish a guild"
    ],
    "basics": {
      "starting_hp": 6,
      "level_hp": 4,
      "armour_prof": "All",
      "weap_prof": "All"
    },
    "equipment": [
      "Chainmail or gambeson",
      "Shield",
      "2 one handed weapons",
      "1 two handed weapon",
      "Smith's kit",
      "Healer's kit",
      "3 rolls on sundries"
    ],
    "core": {
      "Parry": "Parry a melee attack against you as an quick action on an enemy turn. Max once per fight.",
      "Fast Strikes": "Make two full attacks as an action.",
      "It's all in the wrist": "Make three full attacks as an action."
    },
    "archetypes": {
      "Barbarian": {
        "prof": "intimidation, endurance and survival",
        "features": {
          "Rage": "As a quick action enrage yourself. While enraged: damage dice cast by you and against you are increased by 1 size.",
          "Bounding Strides": "Move your movement as a quick action. Max once per fight.",
          "Sweeping Strikes": "When you kill a foe, surplus damage from the strike is dealt to another foe within range."
        }
      },
      "Fighter": {
        "prof": "medicine, endurance and military",
        "features": {
          "Juggernaut": "Gain [ 5 x Level ] temporary HP for the remainder of the fight as a quick action. Max once per rest.",
          "Phalanx": "Allies gain +1 AC when they are near you.",
          "Taunt": "As an action taunt a target. All single target damage done to allies by a chosen creature is halved."
        }
      },
      "Ranger": {
        "prof": "wilderness (including creatures), stealth and perception",
        "features": {
          "Hunter’s mark": "You are able to magically track a target within sight for 1 hour (no barrier can stop this sight) as an action.",
          "Trapper’s kit": "Scavenge for supplies to construct a trap. Roll 1d8 to find out which trap you created. Max once per rest.",
          "On the hunt": "Take a gruesome trophy from a fallen foe as an action; for 1 hour gain +1 to a relevant ability score."
        }
      }
    }
  },
  "Scoundrel": {
    "desc": "You’re sly, cunning, and precise. Stealth is your speciality, and you can bypass obstacles, patrols, and locks better than anyone.",
    "adv_table": [
      "Unseen blade",
      "Uncanny dodge",
      "Quick fingers",
      "Establish a guild"
    ],
    "basics": {
      "starting_hp": 4,
      "level_hp": 2,
      "armour_prof": "Light armour",
      "weap_prof": "Crossbows and all one-handed weapons"
    },
    "equipment": [
      "Gambeson",
      "2 one handed weapons",
      "Crossbow",
      "Ammunition",
      "Thief's kit",
      "5 rolls on sundries"
    ],
    "core": {
      "Unseen blade": "Attacks from stealth are critical hits.",
      "Uncanny dodge": "Choose to half non-magical damage taken from a single source. Max 3 times per rest.",
      "Quick fingers": "All dexterity checks can be done as a quick action."
    },
    "archetypes": {
      "Assassin": {
        "prof": "intimidation, stealth and deception",
        "features": {
          "Potent criticals": "Critical hits do maximum damage.",
          "Poisoner’s kit": "Construct a poison. Each poison uses 1 slot. Max once per rest.",
          "Disguise kit": "Impersonate a target you have studied. This kit uses 1 slot."
        }
      },
      "Bard": {
        "prof": "performance, persuasion/deception and lore",
        "features": {
          "Dissonance": "Interrupt a spell cast within sight as a quick action on an enemy turn. Max once per fight.",
          "Bardic inspiration": "You have [ your level ] worth of inspiration points. Each point can be used, by you or an ally, to gain proficiency with an ability check. Points are renewed after a rest.",
          "Slow dance": "Choose a target as an action, on their next turn they can only use either an action or movement."
        }
      },
      "Arcane Trickster": {
        "prof": "stealth, athletics and thievery",
        "features": {
          "Mage hand": "Summon a spectral hand, as a quick action it can manipulate up to 5 lbs. at a maximum of 10 ft. away",
          "Misty step": "Teleport 10m as a quick action. Max of once per fight.",
          "Clown pockets": "You have maximum load capacity"
        }
      }
    }
  },
  "Zealot": {
    "desc": "You’re devoted, stalwart, and divine. Fervour is your speciality, and your commitment grants you providential powers.",
    "adv_table": [
      "Novice divine spells",
      "Expert divine spells",
      "Master divine spells",
      "Establish a sect"
    ],
    "basics": {
      "starting_hp": 5,
      "level_hp": 3,
      "armour_prof": "All",
      "weap_prof": "Simple"
    },
    "equipment": [
      "Chainmail or gambeson",
      "Shield",
      "One handed simple weapon",
      "Holy symbol",
      "Healer's kit",
      "2 rolls on sundries"
    ],
    "core": {
      "Novice divine spells": "You can use novice divine spells. Add 2 spells from any spell list you can cast from.",
      "Expert divine spells": "You can use expert divine spells. Add 2 spells from any spell list you can cast from.",
      "Master divine spells": "You can use master divine spells. Add 2 spells from any spell list you can cast from."
    },
    "archetypes": {
      "Cleric": {
        "prof": "medicine, religion and divine magic",
        "features": {
          "Death ward": "Ward a target as an action. Damage that would overflow into their CON consumes the ward instead. Max once per rest.",
          "Turn undead": "3HD per level worth of undead flee as an action.",
          "Mass heal": "Allies within 30 ft. are healed [ 2 x their level ] in HP. Max once per rest."
        }
      },
      "Paladin": {
        "prof": "religion, endurance and athletics",
        "features": {
          "Smite": "Deal [ max HP ] damage as an action. 1-in-4 chance to be renewed after a rest.",
          "Bulwark of faith": "Kneel in prayer, creating a 10 ft. semi-circle divine shield in front of you. Lasts up to 1 minute while you pray. Max once per rest.",
          "Sentinel": "Attack a target moving past you as a quick action on an enemy turn."
        }
      },
      "Necromancer": {
        "prof": "medicine, intimidation and occult magic",
        "features": {
          "Raise undead": "Raise [ your level ] corpse(s). Undead require an action to command.",
          "Toll the dead": "A chosen target becomes vulnerable to the next attack. Max once per rest.",
          "Death shroud": "Death CON rolls are done 1 minute after the end of a fight."
        }
      }
    }
  },
  "Mage": {
    "desc": "You’re clever, powerful, and mysterious. You delve into arcane teachings and demonic sacrifices, tapping into eldritch energy.",
    "adv_table": [
      "Novice arcane spells",
      "Expert arcane spells",
      "Master arcane spells",
      "Establish a tower"
    ],
    "basics": {
      "starting_hp": 4,
      "level_hp": 2,
      "armour_prof": "Shields",
      "weap_prof": "Simple"
    },
    "equipment": [
      "One handed simple weapon",
      "Shield OR Crossbow and ammuntion",
      "Scribe's kit",
      "Component pouch",
      "1 rolls on sundries"
    ],
    "core": {
      "Novice arcane spells": "You can use novice arcane spells. Add 2 spells from any spell list you can cast from.",
      "Expert arcane spells": "You can use expert arcane spells. Add 2 spells from any spell list you can cast from.",
      "Master arcane spells": "You can use master arcane spells. Add 2 spells from any spell list you can cast from."
    },
    "archetypes": {
      "Sorcerer": {
        "prof": "persuasion, endurance and arcane magic",
        "features": {
          "Metamagic": "You have 3 metamagic points. Spend a point to make a spell: subtle, quick or twinned. Points are renewed after a rest.",
          "Overchannel": "Greatly increase the potency of a spell being cast. Once per rest.",
          "Firebolt": "Hurl a ball of flame 30 ft. as an action, dealing 1d8 on impact."
        }
      },
      "Warlock": {
        "prof": "deception, stealth and occult magic",
        "features": {
          "Hexblade": "An aspect of your patron manifests as a weapon. You are proficient with this martial weapon.",
          "Blood pact": "Create a binding document with a willing creature; if the pact is in your patron’s favour you will receive a proportionate boon.",
          "Summoning ritual": "Create a summoning circle as an action. Who knows what will come out? 1-in-2 chance to be renewed after rest."
        }
      },
      "Wizard": {
        "prof": "history, insight and arcane magic",
        "features": {
          "Find Familiar": "Summon a familiar that is intelligent and can speak. Requires a long ritual and costly materials to resummon.",
          "Inscription": "Inscribe known spells onto objects; spells cast from such objects don’t require spellcasting checks.",
          "Prestidigitation": "Minor magical effects: transfer heat, visual or auditory illusion, soil/clean an object."
        }
      }
    }
  }
}
